app/View/Components/Companies.php

select * from `companies`
---
    public function render()
    {
        $companines = DB::table('companies')->get();