app/View/Components/material.php

    public function render()
    {
        $material = DB::table('material')->get();
---
select * from `materials`