app/View/Components/terms.php

    public function render()
    {
        $terms = DB::table('terms')->get();
---
select * from `terms`