app/Http/Controllers/CustomersController.php

select * from `users` where `users`.`id` = 1 limit 1
select * from `users`
select * from `customers` where `customers`.`user_id` = 1 and `customers`.`user_id` is not null
---
    public function index() {

        //show a list of customers
        $customers = User::find(\Auth::user()->id)->customers();

        return view('customers.index', ['customers'=> $customers->simplePaginate(4)]);